sfproductlabs/ADuCM350/src/main.c
/*********************************************************************************

Copyright (c) 2013-2014 Analog Devices, Inc. All Rights Reserved.

This software is proprietary to Analog Devices, Inc. and its licensors.  By using 
this software you agree to the terms of the associated Analog Devices Software 
License Agreement.

*********************************************************************************/


/*****************************************************************************
 * @file:    ImpedanceMeasurement_4Wire.c
 * @brief:   Impedance measurement example for ADuCM350 in 4-wire configuration
 *           Bio-Impedance measurement. The ADuCM350 4Wire Bio Config Board is
 *           is required in this example
 * @version: $Revision: 29043 $
 * @date:    $Date: 2014-12-08 08:53:03 -0500 (Mon, 08 Dec 2014) $
 *****************************************************************************/

#include <time.h>
#include <stddef.h>  // for 'NULL'
#include <stdio.h>   // for scanf
#include <string.h>  // for strncmp
#include <stdint.h>

#include "gpio.h"

#define ARM_MATH_CM3 1
#include "arm_math.h"

#include "test_common.h"

#include "flash.h"
#include "assert.h"

#include "sequences.h"
#include "afe.h"
#include "afe_lib.h"
#include "uart.h"
#include "rtc.h"

/* Macro to enable the returning of AFE data using the UART */
/*      1 = return AFE data on UART                         */
/*      0 = return AFE data on SW (Std Output)              */
#define USE_UART_FOR_DATA           (0)

/* Excitation frequency in Hz */
#define FREQ                        (50000)
/* Peak voltage in mV */
#define VPEAK                       (599)
/* RCAL value in Ohms */
#define RCAL                        (1000)
/* RTIA value in Ohms */
#define RTIA                        (33000)

#define RUNNING    (1) /* defaults to yes it's running */
/* Instrumentation Amplifier Gain */
#define INST_AMP_GAIN               (1.494)

/* FCW = FREQ * 2^26 / 16e6 */
#define FCW                         ((uint32_t)(((uint64_t)FREQ << 26) / 16000000 + 0.5))

/* DAC LSB size in mV = (1.6V / (2^12 - 1)) */
#define DAC_LSB_SIZE                (0.39072)

/* Sine amplitude in DAC codes */
#define SINE_AMPLITUDE              ((uint16_t)((VPEAK) / DAC_LSB_SIZE + 0.5))

/* If both real and imaginary result are within the interval (DFT_RESULTS_OPEN_MIN_THR, DFT_RESULTS_OPEN_MAX_THR),  */
/* it is considered an open circuit and results for both magnitude and phase will be 0.                             */
#define DFT_RESULTS_OPEN_MAX_THR    (1)
#define DFT_RESULTS_OPEN_MIN_THR    (-1)

#define CLOCKS_PER_SECOND  (16000) /* how many clocks per second */


/* The number of results expected from the DFT; 4 for 2 complex results */
#define DFT_RESULTS_COUNT           (4)

/* Fractional LSB size for the fixed32_t type defined below, used for printing only. */
#define FIXED32_LSB_SIZE            (625)
#define MSG_MAXLEN                  (50)

/* Helper macro for printing strings to UART or Std. Output */
#define PRINT(s)                    test_print(s)

/* Custom fixed-point type used for final results,              */
/* to keep track of the decimal point position.                 */
/* Signed number with 28 integer bits and 4 fractional bits.    */
typedef union {
    int32_t     full;
    struct {
        uint8_t fpart:4;
        int32_t ipart:28;
    } parts;
} fixed32_t;

ADI_UART_HANDLE     hUartDevice     = NULL;

// leap-year compute macro (ignores leap-seconds)
#define LEAP_YEAR(x) (((0==x%4)&&(0!=x%100))||(0==x%400))
/* device and board specific values selected according to computed trim measurement */
/* THESE VALUES ARE UNIQUE TO THE EVAL-ADUCM350EBZ REV. 0 BOARD, SERIAL#: AVAS 35070 */
#define ADI_RTC_TRIM_INTERVAL    (uint32_t)ADI_RTC_TRIM_INTERVAL_14
#define ADI_RTC_TRIM_DIRECTION   (uint32_t)ADI_RTC_TRIM_SUB
#define ADI_RTC_TRIM_VALUE       (uint32_t)ADI_RTC_TRIM_1

#define UART0_TX_PORTP0_MUX  ((uint16_t) ((uint16_t) 2<<12))
#define UART0_RX_PORTP0_MUX  ((uint16_t) ((uint16_t) 2<<14))

/* Device handle */
ADI_RTC_HANDLE hRTC = NULL;
volatile bool_t bRtcAlarmFlag;
volatile bool_t bRtcInterrupt;
volatile bool_t bWdtInterrupt;
volatile bool_t bHibernateExitFlag;

void rtc_ReportTime(void);
uint32_t BuildSeconds(void);



/* The symbol USE_TIMERS controls whether timer-driven Flash aborts are
 * generated during the test run. This exercises the ability of the driver to
 * cope with flash writes being aborted. Set to zero to disable the timer aborts.
 */
#define USE_TIMERS 1

#if (1 == USE_TIMERS)
static void InitializeWUT(void);
/* pick some 16-bit comparator values for the
   WUT (even though the WUT is 32-bit), because
   the GPT resolution is only 16-bit */
#define LOADB   0x80
#define LOADC  0x800
#define LOADD 0x8000

#define COUNT 5
static uint32_t tickCount = 0u;
static uint32_t wakeCount = 0u;
#endif /* (1 == USE_TIMERS) */

/* CRC polynomial for signature checking */
#define IEEE_802_3_POLYNOMIAL      0x04C11DB7

static bool_t parityErrorOccurred = false;

/* device handles */
static ADI_WUT_DEV_HANDLE hWUT;
static ADI_FEE_DEV_HANDLE  hAbortFlashDevice = NULL;

static char strbuf[256]; /* buffer for logging messages */
static uint32_t totalCount = 0; /* count of test iterations */

/* skipCount is a debugging feature. It is a module-static variable that
 * causes test passes to be skipped up to the specified number. This
 * allows the test cycle to be quickly advanced to a known failing case.
 */
static uint32_t skipCount = 0;

static void writeFlash(ADI_FEE_DEV_HANDLE  hDevice, bool_t useDMA, uint32_t addr, uint32_t length, uint8_t *pBuffer)
{
    ADI_FEE_RESULT_TYPE feeResult = ADI_FEE_ERR_UNSUPPORTED;
    char *psFnName = "adi_FEE_SubmitTxBuffer";

#if (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT)
    if (useDMA)
    {
        // Try to use DMA, if available
        feeResult = adi_FEE_SubmitTxBuffer(hDevice,
                                addr,
                                pBuffer,
                                length);
    }

    if ((ADI_FEE_ERR_UNSUPPORTED != feeResult) &&
        (ADI_FEE_ERR_INVALID_ADDRESS != feeResult) &&
        (ADI_FEE_ERR_INVALID_PARAMETER != feeResult))
    {
        void *pRetBuff = NULL;

