sfproductlabs/ADuCM350/src/main.c
        feeResult = adi_FEE_GetTxBuffer(hDevice, &pRetBuff);

        if (pRetBuff != pBuffer)
        {
            test_Fail("pRetBuff != pBuffer after adi_FEE_GetTxBuffer()");
        }
    }
    else
#endif /* (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT) */
    {
        psFnName = "adi_FEE_Write";

        feeResult = adi_FEE_Write(hDevice,
                                addr,
                                pBuffer,
                                length);
    }

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "%s(addr = 0x%08x, length = %ld) failed with %d\n", psFnName, addr, length, feeResult);
        test_Fail(strbuf);
    }
}

static void verifyFlash(uint32_t baseAddr, uint32_t flashSize, uint32_t relAddr, uint32_t length, uint8_t startVal)
{
    uint8_t *pByte = (uint8_t*)baseAddr;
    uint32_t byteCount;

    for (byteCount = 0u;
         byteCount < relAddr;
         byteCount += 1)
    {
        if (0xFFu != *pByte)
        {
            sprintf(strbuf, "verifyFlash: [0x%08x] != 0xFF", pByte);
            test_Fail(strbuf);
        }

        ++pByte;
    }

    for (;
         byteCount < (relAddr + length);
         byteCount += 1)
    {
        if (startVal != *pByte)
        {
            sprintf(strbuf, "verifyFlash: [0x%08x] != 0x%02x, == 0x%02x", pByte, startVal, *pByte);
            test_Fail(strbuf);
        }

        ++pByte;
        startVal = (startVal + 1) % 255; /* stay within 0-254 range */
    }

    for (;
         byteCount < flashSize;
         byteCount += 1)
    {
        if (0xFFu != *pByte)
        {
            sprintf(strbuf, "verifyFlash: [0x%08x] != 0xFF", pByte);
            test_Fail(strbuf);
        }

        ++pByte;
    }
}

static void erasePages(ADI_FEE_DEV_HANDLE  hDevice, uint32_t addr, uint32_t length)
{
    uint32_t lastAddr = addr + length - 1u;
    uint32_t page, firstPage, lastPage;
    ADI_FEE_RESULT_TYPE feeResult;

     feeResult = adi_FEE_GetPageNumber(hDevice,
                                      addr,
                                      &firstPage);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", addr, feeResult);
        test_Fail(strbuf);
    }

     feeResult = adi_FEE_GetPageNumber(hDevice,
                                      lastAddr,
                                      &lastPage);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", lastAddr, feeResult);
        test_Fail(strbuf);
    }

    for (page = firstPage;
         page <= lastPage;
         ++page)
    {
        feeResult = adi_FEE_PageErase(hDevice, page);

      if (ADI_FEE_SUCCESS != feeResult)
      {
          sprintf(strbuf, "adi_FEE_PageErase(page = %ld) failed with %d\n", page, feeResult);
          test_Fail(strbuf);
      }
    }
}

static void eraseSignaturePage(ADI_FEE_DEV_HANDLE  hDevice, uint32_t baseAddr, uint32_t flashSize)
{
    uint32_t lastAddr = baseAddr + flashSize - 1u;
    uint32_t page;
    ADI_FEE_RESULT_TYPE feeResult;

    feeResult = adi_FEE_GetPageNumber(hDevice,
                                      lastAddr,
                                      &page);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", lastAddr, feeResult);
        test_Fail(strbuf);
    }

    feeResult = adi_FEE_PageErase(hDevice, page);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_PageErase(page = %ld) failed with %d\n", page, feeResult);
        test_Fail(strbuf);
    }
}

static void massErase(ADI_FEE_DEV_HANDLE  hDevice)
{
      ADI_FEE_RESULT_TYPE feeResult;

      feeResult = adi_FEE_MassErase(hDevice);

      if (ADI_FEE_SUCCESS != feeResult)
      {
          test_Fail("mass erase failed");
      }
}

static void checkAndErase(ADI_FEE_DEV_HANDLE  hDevice, uint32_t baseAddr, uint32_t flashSize)
{
    uint32_t *pWord = (uint32_t*)baseAddr;
    uint32_t byteCount;
    ADI_FEE_RESULT_TYPE feeResult;

    for (byteCount = 0u;
         byteCount < flashSize;
         byteCount += 4)
    {
        if (0xFFFFFFFFu != *pWord)
        {
            uint32_t pageNum;

            feeResult = adi_FEE_GetPageNumber(hDevice,
                                        (uint32_t)pWord,
                                        &pageNum);

            if (ADI_FEE_SUCCESS != feeResult)
            {
                sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", pWord, feeResult);
                test_Fail(strbuf);
            }

            sprintf(strbuf, "cleaning up page %ld, address 0x%08x", pageNum, pWord);
            test_Perf(strbuf);
            feeResult = adi_FEE_PageErase(hDevice, pageNum);

            if (ADI_FEE_SUCCESS != feeResult)
            {
                sprintf(strbuf, "adi_FEE_PageErase(page = %ld) failed with %d\n", pageNum, feeResult);
                test_Fail(strbuf);
            }
        }

        ++pWord;
    }

}

static void verifyFlashErased(uint32_t baseAddr, uint32_t flashSize)
{
    uint32_t *pWord = (uint32_t*)baseAddr;
    uint32_t byteCount;

    for (byteCount = 0u;
         byteCount < flashSize;
         byteCount += 4)
    {
        if (0xFFFFFFFFu != *pWord)
        {
            sprintf(strbuf, "flash address 0x%08x != 0xFFFFFFFF", pWord);
            test_Fail(strbuf);
        }

        ++pWord;
    }
}

static void checkSignatures(ADI_FEE_DEV_HANDLE  hDevice, uint32_t baseAddr, uint32_t flashSize, ADI_FEE_SIGN_DIR direction, uint32_t *pSignature)
{
    ADI_FEE_RESULT_TYPE feeResult;
    uint32_t startPage, endPage;
    uint32_t signature = 0u;
    uint32_t endAddr = baseAddr + flashSize - 4u;

    feeResult = adi_FEE_GetPageNumber(hDevice,
                            baseAddr,
                            &startPage);

