sfproductlabs/ADuCM350/src/main.c
    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", baseAddr, feeResult);
        test_Fail(strbuf);
    }

    feeResult = adi_FEE_GetPageNumber(hDevice,
                            endAddr,
                            &endPage);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_GetPageNumber(addr = 0x%08x) failed with %d\n", endAddr, feeResult);
        test_Fail(strbuf);
    }

    feeResult = adi_FEE_VerifySignature(hDevice,
                                        direction,
                                        startPage,
                                        endPage,
                                        &signature);

    if (ADI_FEE_ERR_READ_VERIFY_ERROR != feeResult)
    {
        sprintf(strbuf, "adi_FEE_Sign(%ld, %ld) != ADI_FEE_ERR_READ_VERIFY_ERROR\n", startPage, endPage);
        test_Fail(strbuf);
    }

    if (ADI_FEE_SIGN_REVERSE == direction)
    {
        endAddr -= 4u;
    }

    feeResult = adi_FEE_Write(hDevice,
                            endAddr,
                            (uint8_t*)&signature,
                            4u);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_Write() of signature word at 0x%08x failed with %d\n", endAddr, feeResult);
        test_Fail(strbuf);
    }

    feeResult = adi_FEE_VerifySignature(hDevice,
                                        direction,
                                        startPage,
                                        endPage,
                                        &signature);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_Sign(%ld, %ld) != ADI_FEE_SUCCESS\n", startPage, endPage);
        test_Fail(strbuf);
    }

    *pSignature = signature;
}


#if 1
#include "crc32.h"     /* include the header file generated with pycrc */

/*
 * Software implementation of the signature algorithm, used
 * for checking the hardware-produced signatures. This version uses a
 * module (crc32.c) which was generated by pycrc (http://www.tty1.net/pycrc/)
 * using the following command lines:
 *
 * python pycrc.py --generate=h --output=crc32.h --model=crc-32 --algorithm=tbl
 *  --xor-out=0 --reflect-in=true --reflect-out=false
 * python pycrc.py --generate=c --output=crc32.c --model=crc-32 --algorithm=tbl
 *  --xor-out=0 --reflect-in=true --reflect-out=false
 *
 * Assumes start and end addresses are word-aligned.
 */
static uint32_t
crcBlock(
    uint32_t addr,
    uint32_t endAddr,
    const int32_t stride,
    const uint32_t polynomial,
    const uint32_t crc)
{
    uint32_t pyCrc = crc_init();

    /* Outer loop - iterates over data words */
    for(;;) /* middle-breaking loop */
    {
        uint32_t *pWord = ((uint32_t  *)addr);
        uint32_t  word = __RBIT(*pWord);

        pyCrc = crc_update(pyCrc, (uint8_t*)&word, 4);

        if (addr == endAddr) break; /* loop breaks here */

        addr += stride;
    }

    return crc_finalize(pyCrc);
}
#else
/*
 * Software implementation of the signature algorithm, used
 * for checking the hardware-produced signatures.
 * Assumes start and end addresses are word-aligned.
 */
static uint32_t
crcBlock(
    uint32_t addr,
    uint32_t endAddr,
    const int32_t stride,
    const uint32_t polynomial,
    uint32_t crc)
{
    /* Outer loop - iterates over data words */
    for(;;) /* middle-breaking loop */
    {
        uint32_t data = *((uint32_t *)addr);
        uint32_t i;

        /* Inner loop - updates CRC from current data word */
        for (i = 0;     i < 32; i++)
        {
            uint32_t xor = data ^ crc;

            crc  <<= 1;
            data <<= 1;

            if (xor & 0x80000000)
            {
                crc ^= polynomial;
            }
        }

        if (addr == endAddr) break; /* loop breaks here */

        addr += stride;
    }

    return crc;
}
#endif

static void testParityChecking(ADI_FEE_DEV_ID_TYPE const devID, uint32_t flashBase, uint32_t flashStart, uint32_t nWords, uint32_t parityBase)
{
    ADI_FEE_RESULT_TYPE feeResult;
    ADI_FEE_DEV_HANDLE  hDevice;
    uint32_t   offset = (flashStart & 0x1Fu);
    uint32_t   addr   = (flashStart >> 3u) | parityBase;
    uint32_t *pFlashWord = (uint32_t*)flashStart;
    uint32_t wordsProcessed = 0u;

    test_Perf("Testing parity checking");

    feeResult = adi_FEE_Init(devID, true, &hDevice);

    if (ADI_FEE_SUCCESS != feeResult)
    {
      test_Fail("adi_FEE_Init() failed\n");
    }

    /* Erase the parity region first, so we know that it will fail checking */
    erasePages(hDevice, addr,  nWords/8);

    feeResult = adi_FEE_SetParityChecking(hDevice, ADI_FEE_PARITY_ENABLE_INTERRUPT);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_SetParityChecking(ON) failed\n");
    }

    /* If we're executing from this flash memory then a parity error should occur immediately,
     * otherwise we need to force one with a data read. */
    if (!parityErrorOccurred)
    {
        volatile uint32_t dummy = *(uint32_t*)flashBase;
    }

    if (parityErrorOccurred)
    {
        pADI_FEE0->FEEPARSTA = 0x1u; /* clear the parity error indication */
    }
    else
    {
        test_Fail("No parity error detected");
    }

    feeResult = adi_FEE_SetParityChecking(hDevice, ADI_FEE_PARITY_DISABLE);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_SetParityChecking(OFF) failed\n");
    }

    NVIC_ClearPendingIRQ(PARITY_IRQn); /* Clear any latched parity interrupt */

    /* Now generate the correct parity information and write it to flash.
    */
    while (wordsProcessed < nWords)    /* For each word in specified region */
    {
        uint32_t nParityWord = 0xFFFFFFFFu;       /* aligned word for write */

