sfproductlabs/ADuCM350/src/main.c
        if (ADI_FEE_SUCCESS != feeResult)
        {
            test_Fail("adi_FEE_SetParityChecking(ON) failed\n");
        }
    }

    feeResult = adi_FEE_UnInit(hDevice);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_UnInit() failed\n");
    }

    test_Perf("testFlash finished.");

    return 0;
}

void HardFault_Handler(void)
{
    test_Fail("Hard fault");
}

void BusFault_Handler(void)
{
    test_Fail("Bus fault");
}

void Parity_Int_Handler(void)
{
    if (parityErrorOccurred)
    {
         uint32_t errAddrLo = pADI_FEE0->FEEPARADRL;
         uint32_t errAddrHi = pADI_FEE0->FEEPARADRH;

         /* The first parity error was expected, this one isn't */
         sprintf(strbuf, "FLASH parity error, address = 0x%04x%04x", errAddrHi, errAddrLo);
         test_Fail(strbuf);
    }
    else
    {
        /* This is an expected parity error */
        parityErrorOccurred = true;
        NVIC_DisableIRQ(PARITY_IRQn);
   }
}



#if (1 == USE_TIMERS)
/**
 * @brief  Interrupt handler for SysTick example program
 *
 * @return none
 *
 * SysTick Handler is called whenever SysTick interrupt occurs.
 * In this example, the handler increments the interrupt count
 */
void SysTick_Handler(void)
{
    /* bump Count up to COUNT  */
    if (COUNT != tickCount)
        tickCount += 1;

    if (NULL != hAbortFlashDevice)
    {
        adi_FEE_Abort(hAbortFlashDevice);
    }
}

static void wutCallback(void* hWut, uint32_t Event, void* pArg)
{
    ++wakeCount;
    pADI_WUT->T2CLRI |= T2CLRI_WUFB_CLR;
}

static void InitializeWUT(void)
{
    /* Initialise the wakeup timer */
    if( adi_WUT_Init(ADI_WUT_DEVID_0, &hWUT) != 0 ) {
        FAIL("adi_WUT_Init failed");
    }

    /* install WUT callback on all interrupts */
    if (adi_WUT_RegisterCallback(hWUT, wutCallback, ADI_WUT_TARGET_MASK)) {
        FAIL("adi_WUT_RegisterCallback failed");
    }

    /* Enable Wakeup timer in NVIC */
    NVIC_EnableIRQ(WUT_IRQn);

    /* select UCLK clock source */
    if( adi_WUT_SetClockSelect(hWUT, ADI_WUT_CLK_PCLK) != 0 ) {
        FAIL("adi_WUT_SetClockSelect failed");
    }

    /* No pre-scaling */
    if( adi_WUT_SetPrescaler(hWUT, (ADI_WUT_PRESCALER_TYPE)T2CON_PRE_DIV256) != 0 ) {
        FAIL("adi_WUT_SetPrescaler failed");
    }

    /* select free-running mode */
    if( adi_WUT_SetTimerMode(hWUT, ADI_WUT_MODE_PERIODIC) != 0 ) {
        FAIL("adi_WUT_SetTimerMode failed");
    }

    /* preload B comparator */
    if( adi_WUT_SetComparator(hWUT, ADI_WUT_COMPB, LOADB) != 0) {
        FAIL("adi_WUT_SetComparator failed");
    }
    /* enable Binterrupt */
    if( adi_WUT_SetInterruptEnable(hWUT, ADI_WUT_COMPB, true) != 0 ) {
        FAIL("adi_WUT_SetInterruptEnable failed");
    }
}

#endif /* (1 == USE_TIMERS) */





//
//
//
//
//
//int32_t adi_initpinmux(void) {
//    /* Port Control MUX registers */
//    *((volatile uint32_t *)REG_GPIO0_GPCON) = UART0_TX_PORTP0_MUX | UART0_RX_PORTP0_MUX;
//
//
//    return 0;
//}

/* callbacks */
void rtcCallback (void *pCBParam, uint32_t Event, void *EventArg);
//static void Ext_Int8_Callback (void *pCBParam, uint32_t Event, void *pArg);

/* Function prototypes */
q15_t                   arctan                  (q15_t imag, q15_t real);
fixed32_t calculate_magnitude(q31_t magnitude_1, q31_t magnitude_2, uint32_t res);
fixed32_t               calculate_phase         (q15_t phase_rcal, q15_t phase_z);
void                    convert_dft_results     (int16_t *dft_results, q15_t *dft_results_q15, q31_t *dft_results_q31);
void                    sprintf_fixed32         (char *out, fixed32_t in);
void                    print_MagnitudePhase    (char *text, fixed32_t magnitude, fixed32_t phase);
void                    test_print              (char *pBuffer);
ADI_UART_RESULT_TYPE    uart_Init               (void);
ADI_UART_RESULT_TYPE    uart_UnInit             (void);
void                    delay                   (uint32_t counts);
extern int32_t          adi_initpinmux          (void);
void rtc_Init(void);
// void rtc_Calibrate(void);

/* Sequence for 4-Wire Bio-Impedance measurement, performs 2 DFTs:  */
/*     TIA (Current) and AN_A (Voltage)                               */
//uint32_t seq_afe_acmeasBioZ_4wire[] = {
//    0x0016001A,   /* Safety word: bits 31:16 = command count, bits 7:0 = CRC                */
//    0x84005818,   /* AFE_FIFO_CFG: DATA_FIFO_SOURCE_SEL = 10                                */
//    0x8A000034,   /* AFE_WG_CFG: TYPE_SEL = 10                                              */
//    0x98000000,   /* AFE_WG_CFG: SINE_FCW = 0 (placeholder, user programmable)              */
//    0x9E000000,   /* AFE_WG_AMPLITUDE: SINE_AMPLITUDE = 0 (placeholder, user programmable)  */
//    0x88000F00,   /* DAC_CFG: DAC_ATTEN_EN = 0                                              */
//    /* TIA  */
//    0x86007788,   /* DMUX_STATE = 8, PMUX_STATE = 8, NMUX_STATE = 7, TMUX_STATE = 7         */
//    0xA0000002,   /* AFE_ADC_CFG: TIA, no bypass, offset and gain correction.               */
//    0x0080E800,   /* Wait 528ms.                                                            */
//                  /* This is the worst case settling time:                                  */
//                  /* Rcm=10M, Ciso=22nF(20%tol) => settling time = 2*RC = 528 ms            */
//                  /* This settling time is only required the first time the switches are    */
//                  /* closed.                                                                */
//    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
//    0x00000C80,   /* Wait 200us                                                             */
//    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
//    0x00032340,   /* Wait 13ms ( -148us to stop at midscale)                                */
//    0x80020EF0,   /* AFE_CFG: ADC_CONV_EN = 0, DFT_EN = 0                                   */
//    /* AN_A */
//    0xA0000208,   /* AFE_ADC_CFG: AN_A, Use GAIN and OFFSET AUX                             */
//    0x00000640,   /* Wait 100us                                                             */
//    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
//    0x00000C80,   /* Wait 200us                                                             */
//    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
//    0x00032340,   /* Wait 13ms                                                              */
//    0x80020EF0,   /* AFE_CFG: WAVEGEN_EN, ADC_CONV_EN = 0, DFT_EN = 0                       */
//    0x86007788,   /* DMUX_STATE = 0, PMUX_STATE = 0, NMUX_STATE = 0, TMUX_STATE = 0         */
//    0x82000002,   /* AFE_SEQ_CFG: SEQ_EN = 0                                                */
//};

/* Sequence for 4-Wire Bio-Impedance measurement, performs 2 DFTs:  */
/*     TIA (Current) and AN_A (Voltage)                               */
//uint32_t seq_afe_fast_acmeasBioZ_4wire[] = {
//
//    0x0016001A,   /* Safety word: bits 31:16 = command count, bits 7:0 = CRC                */
//    0x84005818,   /* AFE_FIFO_CFG: DATA_FIFO_SOURCE_SEL = 10                                */
//    0x8A000034,   /* AFE_WG_CFG: TYPE_SEL = 10                                              */
//    0x98000000,   /* AFE_WG_CFG: SINE_FCW = 0 (placeholder, user programmable)              */
//    0x9E000000,   /* AFE_WG_AMPLITUDE: SINE_AMPLITUDE = 0 (placeholder, user programmable)  */
//    0x88000F00,   /* DAC_CFG: DAC_ATTEN_EN = 0                                              */
//
//    /* TIA  */
//    0x86007788,   /* DMUX_STATE = 8, PMUX_STATE = 8, NMUX_STATE = 7, TMUX_STATE = 7         */
//    0xA0000002,   /* AFE_ADC_CFG: TIA, no bypass, offset and gain correction.               */
//    // 0x00000640,   /* wait 100us */
//    0x00003E80,      /* 20 ms */
//    //0x0080E800,   /* Wait 528ms.                                                            */
//                  /* This is the worst case settling time:                                  */
//                  /* Rcm=10M, Ciso=22nF(20%tol) => settling time = 2*RC = 528 ms            */
//                  /* This settling time is only required the first time the switches are    */
//                  /* closed.                                                                */
//    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
//    0x00000C80,   /* Wait 200us                                                             */
//    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
//    0x00032340,   /* Wait 13ms ( -148us to stop at midscale)                                */
//    0x80020EF0,   /* AFE_CFG: ADC_CONV_EN = 0, DFT_EN = 0                                   */
//
//    /* AN_A */
//    0xA0000208,   /* AFE_ADC_CFG: AN_A, Use GAIN and OFFSET AUX                             */
//    0x00000640,   /* Wait 100us                                                             */
//    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
//    0x00000C80,   /* Wait 200us                                                             */
//    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
//    0x00032340,   /* Wait 13ms                                                              */
//    0x80020EF0,   /* AFE_CFG: WAVEGEN_EN, ADC_CONV_EN = 0, DFT_EN = 0                       */
//    0x86007788,   /* DMUX_STATE = 0, PMUX_STATE = 0, NMUX_STATE = 0, TMUX_STATE = 0         */
//    0x82000002,   /* AFE_SEQ_CFG: SEQ_EN = 0                                                */
//};

