sfproductlabs/ADuCM350/src/main.c
uint32_t seq_afe_poweritup[] = {
    5 << 16 | 0x43,
    0x84005818,   /* AFE_FIFO_CFG: DATA_FIFO_SOURCE_SEL = 10                                */
    0x8A000034,   /* AFE_WG_CFG: TYPE_SEL = 10                                              */
    0x98000000,   /* AFE_WG_CFG: SINE_FCW = 0 (placeholder, user programmable)              */
    0x9E000000,   /* AFE_WG_AMPLITUDE: SINE_AMPLITUDE = 0 (placeholder, user programmable)  */
    0x88000F00,   /* DAC_CFG: DAC_ATTEN_EN = 0                                              */

};

uint32_t seq_afe_fast_meas_4wire[] = {

    17 << 16 | 0x43,
    /* TIA  */
    0x86007788,   /* DMUX_STATE = 8, PMUX_STATE = 8, NMUX_STATE = 7, TMUX_STATE = 7         */
    0xA0000002,   /* AFE_ADC_CFG: TIA, no bypass, offset and gain correction.               */
    0x00000640,   /* wait 100us */
    //0x00027100,    /* wait 10ms */
    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
    0x00000C80,   /* Wait 200us                                                             */
    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
    0x00032340,   /* Wait 13ms ( -148us to stop at midscale)                                */
    0x80020EF0,   /* AFE_CFG: ADC_CONV_EN = 0, DFT_EN = 0                                   */

    /* AN_A */
    0xA0000208,   /* AFE_ADC_CFG: AN_A, Use GAIN and OFFSET AUX                             */
    0x00000640,   /* Wait 100us                                                             */
    0x80024EF0,   /* AFE_CFG: WAVEGEN_EN = 1                                                */
    0x00000C80,   /* Wait 200us                                                             */
    0x8002CFF0,   /* AFE_CFG: ADC_CONV_EN = 1, DFT_EN = 1                                   */
    0x00032340,   /* Wait 13ms                                                              */
    //0x00000C80,   /* Wait 200us                                                             */
    0x80020EF0,   /* AFE_CFG: WAVEGEN_EN, ADC_CONV_EN = 0, DFT_EN = 0                       */
    0x86007788,   /* DMUX_STATE = 0, PMUX_STATE = 0, NMUX_STATE = 0, TMUX_STATE = 0         */
    0x82000002,   /* AFE_SEQ_CFG: SEQ_EN = 0                                                */
};

extern void initialise_monitor_handles(void);

typedef struct {
    ADI_GPIO_PORT_TYPE Port;
    ADI_GPIO_DATA_TYPE Pins;
} PinMap;

PinMap led_DISPLAY  = {ADI_GPIO_PORT_0, ADI_GPIO_PIN_11};
PinMap led_DISPLAY1 = {ADI_GPIO_PORT_4, ADI_GPIO_PIN_2};

int main/*********************************************************************************

Copyright (c) 2013-2014 Analog Devices, Inc. All Rights Reserved.

This software is proprietary to Analog Devices, Inc. and its licensors.  By using
this software you agree to the terms of the associated Analog Devices Software
License Agreement.

*********************************************************************************/

/*!
 *****************************************************************************
 * @file:    FlashTest.c
 * @brief:   Flash Device Example for ADuCM350
 * @version: $Revision: 28544 $
 * @date:    $Date: 2014-11-13 13:09:44 -0500 (Thu, 13 Nov 2014) $
 *****************************************************************************/

/** \addtogroup FlashTest_Example Flash Example
 *  Example code demonstrating use of the flash memory driver.
 *  @{
 */

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>

#ifndef _ILONG
#error Needs _ILONG
#endif

#include "wut.h"

#include "test_common.h"
#include <flash.h>

#include <ADuCM350_device.h>

#if defined ( __ICCARM__ )  // IAR compiler...
/* Apply ADI MISRA Suppressions */
#define ASSERT_ADI_MISRA_SUPPRESSIONS
#include "misra.h"
#endif

/* The symbol USE_TIMERS controls whether timer-driven Flash aborts are
 * generated during the test run. This exercises the ability of the driver to
 * cope with flash writes being aborted. Set to zero to disable the timer aborts.
 */
#define USE_TIMERS 1

#if (1 == USE_TIMERS)
static void InitializeWUT(void);
/* pick some 16-bit comparator values for the
   WUT (even though the WUT is 32-bit), because
   the GPT resolution is only 16-bit */
#define LOADB   0x80
#define LOADC  0x800
#define LOADD 0x8000

#define COUNT 5
static uint32_t tickCount = 0u;
static uint32_t wakeCount = 0u;
#endif /* (1 == USE_TIMERS) */

/* CRC polynomial for signature checking */
#define IEEE_802_3_POLYNOMIAL      0x04C11DB7

static bool_t parityErrorOccurred = false;

/* device handles */
static ADI_WUT_DEV_HANDLE hWUT;
static ADI_FEE_DEV_HANDLE  hAbortFlashDevice = NULL;

static char strbuf[256]; /* buffer for logging messages */
static uint32_t totalCount = 0; /* count of test iterations */

/* skipCount is a debugging feature. It is a module-static variable that
 * causes test passes to be skipped up to the specified number. This
 * allows the test cycle to be quickly advanced to a known failing case.
 */
static uint32_t skipCount = 0;

static void writeFlash(ADI_FEE_DEV_HANDLE  hDevice, bool_t useDMA, uint32_t addr, uint32_t length, uint8_t *pBuffer)
{
    ADI_FEE_RESULT_TYPE feeResult = ADI_FEE_ERR_UNSUPPORTED;
    char *psFnName = "adi_FEE_SubmitTxBuffer";

#if (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT)
    if (useDMA)
    {
        // Try to use DMA, if available
        feeResult = adi_FEE_SubmitTxBuffer(hDevice,
                                addr,
                                pBuffer,
                                length);
    }

    if ((ADI_FEE_ERR_UNSUPPORTED != feeResult) &&
        (ADI_FEE_ERR_INVALID_ADDRESS != feeResult) &&
        (ADI_FEE_ERR_INVALID_PARAMETER != feeResult))
    {
        void *pRetBuff = NULL;

        feeResult = adi_FEE_GetTxBuffer(hDevice, &pRetBuff);

        if (pRetBuff != pBuffer)
        {
            test_Fail("pRetBuff != pBuffer after adi_FEE_GetTxBuffer()");
        }
    }
    else
#endif /* (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT) */
    {
        psFnName = "adi_FEE_Write";

        feeResult = adi_FEE_Write(hDevice,
                                addr,
                                pBuffer,
                                length);
    }

