sfproductlabs/ADuCM350/src/main.c
    /* Turn parity checking back on for the remainder of program execution */
    feeResult = adi_FEE_SetParityChecking(hDevice, ADI_FEE_PARITY_ENABLE_INTERRUPT);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_SetParityChecking(ON) failed\n");
    }

    feeResult = adi_FEE_UnInit(hDevice);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_UnInit() failed\n");
    }

    test_Perf("Parity checking test complete, parity checking now enabled");
}

static int testFlash(char *psDesc,
                     ADI_FEE_DEV_ID_TYPE const devID,
                     bool_t useDMA,
                     uint32_t const baseAddr,
                     uint32_t kiloBytes,
                     uint32_t iterations)
{
    ADI_FEE_RESULT_TYPE feeResult;
    ADI_FEE_DEV_HANDLE  hDevice;
    uint32_t flashSize = kiloBytes*1024u;
    uint32_t rnd = RAND_MAX;;
    uint32_t count = 0u;
    static uint8_t buffer[4096];
    uint32_t i;
    uint32_t forwardSig, reverseSig;

    /* Fill source buffer */
    for (i = 0u;
         i < sizeof(buffer);
         ++i)
    {
        buffer[i] = (uint8_t)(i % 255);
    }

    test_Perf(psDesc);

    /* Initialize flash driver */
    feeResult = adi_FEE_Init(devID, true, &hDevice);

    if (ADI_FEE_SUCCESS != feeResult)
    {
      test_Fail("adi_FEE_Init() failed\n");
    }

    /* Note: parity checking is turned off, for the specified flash controller,
     * by adi_FEE_Init(). If not then we would need to explicitly disable parity
     * checking here to avoid parity errors on data reads from the flash, as
     * we do not update the parity bits when writing to the flash region for
     * testing.
     */

#if (1 == USE_TIMERS)
    hAbortFlashDevice = hDevice;
    feeResult = adi_FEE_SetInterruptAbort(hDevice, WUT_IRQn, 1);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        sprintf(strbuf, "adi_FEE_SetInterruptAbort(%ld) failed with %d\n", SysTick_IRQn, feeResult);
        test_Fail(strbuf);
    }
#endif /* (1 == USE_TIMERS) */

    checkAndErase(hDevice, baseAddr, flashSize);

    assert(0x3FFFFFFF == RAND_MAX);

    /* Check that the flash array is all 0xFFFFFFFF */
    verifyFlashErased(baseAddr, flashSize);

    for(count = 1; count <= iterations; ++count)
    {
        uint32_t relAddr = rand() % (flashSize - 8);
        uint32_t limit = flashSize - relAddr - 8;
        uint32_t length = rnd;

        if (limit > 4095)
            limit = 4095;

        length = (rand() % limit);
        length >>= (rand() % 12);
        length += 1;

        if (ADI_FEE_DEVID_GP == devID)
        {
            /* Round down/up to 4-byte boundaries, so we can use DMA */
            relAddr &= ~3u;
            length = (length + 3) & ~3u;
        }

        assert(relAddr < 0x20000u);
        assert(length > 0u);
        assert(length <= 4096u);

        if (++totalCount <= skipCount)
        {
            continue;
        }

        sprintf(strbuf, "%3d: Testing absAddr = 0x%08lX, length = %lu",
                totalCount, baseAddr + relAddr, length);
        test_Perf(strbuf);

        writeFlash(hDevice, useDMA, baseAddr + relAddr, length, buffer);
        verifyFlash(baseAddr, flashSize - 8u, relAddr, length, 0u);

        /* check the flash signature */
        checkSignatures(hDevice, baseAddr, flashSize, ADI_FEE_SIGN_FORWARD, &forwardSig);

        if (forwardSig != crcBlock(baseAddr, baseAddr + flashSize - 12u, +4, IEEE_802_3_POLYNOMIAL, 0xFFFFFFFFu))
        {
            test_Fail("Forward signature doesn't match calculated CRC");
        }

        checkSignatures(hDevice, baseAddr, flashSize, ADI_FEE_SIGN_REVERSE, &reverseSig);

        if (reverseSig != crcBlock(baseAddr + flashSize - 12u, baseAddr, -4, IEEE_802_3_POLYNOMIAL, 0xFFFFFFFFu))
        {
            test_Fail("Reverse signature doesn't match calculated CRC");
        }

        /* We expect different signatures for the forward and reverse directions. It is
         * Possible for them to be the same, but this is unlikely enough that we should
         * be able to discount the possibility.
        */
        if (forwardSig == reverseSig)
        {
            test_Fail("Forward and reverse signatures are the same");
        }

        if (ADI_FEE_DEVID_0 == devID)
        {
            /* For flash controller 0 we don't use mass erase,
             * as our own code will be in the lower part of it.
             */
            erasePages(hDevice, baseAddr + relAddr, length);
            eraseSignaturePage(hDevice, baseAddr, flashSize);
        }
        else
        {
            /* For flash controller 1 or the GPF controller we
             * can use the mass erase.
             */
            massErase(hDevice);
        }

        verifyFlashErased(baseAddr, flashSize);
    }

    /* If we've just finished testing flash controller 0 then turn parity checking back
     * on for the remainder of program execution. Parity checking has to remain off during
     * testing, to avoid parity errors on data reads from the flash, but turning it on
     * here allows subsequent instruction fetches from flash 0 to be parity-checked.
     */
    if (ADI_FEE_DEVID_0 == devID)
    {
        feeResult = adi_FEE_SetParityChecking(hDevice, ADI_FEE_PARITY_ENABLE_INTERRUPT);

        if (ADI_FEE_SUCCESS != feeResult)
        {
            test_Fail("adi_FEE_SetParityChecking(ON) failed\n");
        }
    }

    feeResult = adi_FEE_UnInit(hDevice);

    if (ADI_FEE_SUCCESS != feeResult)
    {
        test_Fail("adi_FEE_UnInit() failed\n");
    }

    test_Perf("testFlash finished.");

    return 0;
}

void HardFault_Handler(void)
{
    test_Fail("Hard fault");
}

void BusFault_Handler(void)
{
    test_Fail("Bus fault");
}

void Parity_Int_Handler(void)
{
    if (parityErrorOccurred)
    {
         uint32_t errAddrLo = pADI_FEE0->FEEPARADRL;
         uint32_t errAddrHi = pADI_FEE0->FEEPARADRH;

         /* The first parity error was expected, this one isn't */
         sprintf(strbuf, "FLASH parity error, address = 0x%04x%04x", errAddrHi, errAddrLo);
         test_Fail(strbuf);
    }
    else
    {
        /* This is an expected parity error */
        parityErrorOccurred = true;
        NVIC_DisableIRQ(PARITY_IRQn);
   }
}

/**
 * @brief  Function 'main' for flash memory test program.
 *
 * @return int (Zero for success, non-zero for failure).
 *
 *
 *
 *
 */
int main4()
{
    /* Clock initialization */
    SystemInit();

    // Change HCLK clock divider to 1 for a 16MHz clock
    if (ADI_SYS_SUCCESS != SetSystemClockDivider(ADI_SYS_CLOCK_CORE, 1))
    {
            test_Fail("SetSystemClockDivider() failed");
    }

    // Change PCLK clock divider to 1 for a 16MHz clock
    if (ADI_SYS_SUCCESS != SetSystemClockDivider (ADI_SYS_CLOCK_UART, 1))
    {
            test_Fail("SetSystemClockDivider() failed");
    }

    /* test system initialization */
    test_Init();

