sfproductlabs/ADuCM350/src/main.c
    /* NVIC initialization */
    NVIC_SetPriorityGrouping(12);

#if (1 == USE_TIMERS)
    /* SysTick initialization */
    SysTick_Config(1000000);

    /* SysTick_Config() hardcodes priority. We override this. */
    NVIC_SetPriority(SysTick_IRQn, 14);

    /* Wakeup timer initialization */
    InitializeWUT();

    if( adi_WUT_SetTimerEnable(hWUT, true) != 0 ) {
        test_Fail("adi_WUT_SetTimerEnable failed");
    }
#endif /* (1 == USE_TIMERS) */

    testParityChecking(ADI_FEE_DEVID_0, 0x00000000u, 0x00000000u, 0x8000u, 0x0003E000u);
    testParityChecking(ADI_FEE_DEVID_1, 0x00040000u, 0x00040000u, 0x7C00u, 0x0005F000u);


    /* We *want* a repeatable sequence of psuedo-random numbers, so that
     * the flash address ranges tested are the same on each run. Since
     * the rand seed starts at zero by default this call only serves to
     * make this explicit and visible.
     */
    srand(0);

    /* Test flash controller 0 (upper half only, minus the parity area = 120k) */
    testFlash("Testing flash controller 0", ADI_FEE_DEVID_0, false, 0x00020000u, 120, 10);

    /* Test flash controller 1 (all) */
    testFlash("Testing flash controller 1", ADI_FEE_DEVID_1, true, 0x00040000u, 128, 10);

    /* Test GP flash controller (all) using PIO*/
    testFlash("Testing GP flash controller (PIO)", ADI_FEE_DEVID_GP, false, 0x20080000u, 16, 10);

#if (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT)
    /* Test GP flash controller (all) using DMA*/
    testFlash("Testing GP flash controller (DMA)", ADI_FEE_DEVID_GP, true, 0x20080000u, 16, 10);
#endif /* (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT) */

    /* If we got here then nothing has failed */
    test_Pass();

    return 0;
}


#if (1 == USE_TIMERS)
/**
 * @brief  Interrupt handler for SysTick example program
 *
 * @return none
 *
 * SysTick Handler is called whenever SysTick interrupt occurs.
 * In this example, the handler increments the interrupt count
 */
void SysTick_Handler(void)
{
    /* bump Count up to COUNT  */
    if (COUNT != tickCount)
        tickCount += 1;

    if (NULL != hAbortFlashDevice)
    {
        adi_FEE_Abort(hAbortFlashDevice);
    }
}

static void wutCallback(void* hWut, uint32_t Event, void* pArg)
{
    ++wakeCount;
    pADI_WUT->T2CLRI |= T2CLRI_WUFB_CLR;
}

static void InitializeWUT(void)
{
    /* Initialise the wakeup timer */
    if( adi_WUT_Init(ADI_WUT_DEVID_0, &hWUT) != 0 ) {
        FAIL("adi_WUT_Init failed");
    }

    /* install WUT callback on all interrupts */
    if (adi_WUT_RegisterCallback(hWUT, wutCallback, ADI_WUT_TARGET_MASK)) {
        FAIL("adi_WUT_RegisterCallback failed");
    }

    /* Enable Wakeup timer in NVIC */
    NVIC_EnableIRQ(WUT_IRQn);

    /* select UCLK clock source */
    if( adi_WUT_SetClockSelect(hWUT, ADI_WUT_CLK_PCLK) != 0 ) {
        FAIL("adi_WUT_SetClockSelect failed");
    }

    /* No pre-scaling */
    if( adi_WUT_SetPrescaler(hWUT, (ADI_WUT_PRESCALER_TYPE)T2CON_PRE_DIV256) != 0 ) {
        FAIL("adi_WUT_SetPrescaler failed");
    }

    /* select free-running mode */
    if( adi_WUT_SetTimerMode(hWUT, ADI_WUT_MODE_PERIODIC) != 0 ) {
        FAIL("adi_WUT_SetTimerMode failed");
    }

    /* preload B comparator */
    if( adi_WUT_SetComparator(hWUT, ADI_WUT_COMPB, LOADB) != 0) {
        FAIL("adi_WUT_SetComparator failed");
    }
    /* enable Binterrupt */
    if( adi_WUT_SetInterruptEnable(hWUT, ADI_WUT_COMPB, true) != 0 ) {
        FAIL("adi_WUT_SetInterruptEnable failed");
    }
}

#endif /* (1 == USE_TIMERS) */

#if defined ( __ICCARM__ )  // IAR compiler...
/* Revert ADI MISRA Suppressions */
#define REVERT_ADI_MISRA_SUPPRESSIONS
#include "misra.h"
#endif


/*
** EOF
*/

/*@}*/(void) {
	initialise_monitor_handles();

    ADI_AFE_DEV_HANDLE  hDevice;
    int16_t             dft_results[DFT_RESULTS_COUNT];
    q15_t               dft_results_q15[DFT_RESULTS_COUNT];
    q31_t               dft_results_q31[DFT_RESULTS_COUNT];
    q31_t               magnitude[DFT_RESULTS_COUNT / 2];
    //q15_t               phase[DFT_RESULTS_COUNT / 2];
    //fixed32_t           magnitude_result[DFT_RESULTS_COUNT / 2 - 1];
    //fixed32_t           phase_result[DFT_RESULTS_COUNT / 2 - 1];

    uint32_t            offset_code;
    uint32_t            gain_code;
    uint32_t            rtiaAndGain;
    int8_t              running;
    running = RUNNING;

    /* Initialize system */
    SystemInit();

    test_Init();
//
//       /* Initialize GPIO */
//       if (ADI_GPIO_SUCCESS != adi_GPIO_Init())
//       {
//           FAIL("adi_GPIO_Init");
//       }
//
//       /* Enable GPIO output drivers */
//       if (ADI_GPIO_SUCCESS != adi_GPIO_SetOutputEnable(led_DISPLAY.Port, led_DISPLAY.Pins, true))
//       {
//           FAIL("adi_GPIO_SetOutputEnable (led_DISPLAY)");
//       }
//       if (ADI_GPIO_SUCCESS != adi_GPIO_SetOutputEnable(led_DISPLAY1.Port, led_DISPLAY1.Pins, true))
//       {
//           FAIL("adi_GPIO_SetOutputEnable (led_DISPLAY1)");
//       }
//
//       volatile uint32_t   i;
//   	uint32_t            count = 0;
//   	/* Loop indefinitely */
//       while (1)
//       {
//   		/* Delay */
//   		for (i = 0; i < 50000; i++)
//               ;
//
//   		/* Flash the count using the LEDs */
//   		switch (count++)
//           {
//   			case 3:
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetLow(led_DISPLAY.Port,  led_DISPLAY.Pins))
//                   {
//                       FAIL("adi_GPIO_SetLow (led_DISPLAY)");
//                   }
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetLow(led_DISPLAY1.Port, led_DISPLAY1.Pins))
//                   {
//                       FAIL("adi_GPIO_SetLow (led_DISPLAY1)");
//                   }
//   				break;
//
//   			case 2:
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetHigh(led_DISPLAY.Port,  led_DISPLAY.Pins))
//                   {
//                       FAIL("adi_GPIO_SetHigh (led_DISPLAY)");
//                   }
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetLow(led_DISPLAY1.Port, led_DISPLAY1.Pins))
//                   {
//                       FAIL("adi_GPIO_SetLow (led_DISPLAY1)");
//                   }
//   				break;
//
//   			case 1:
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetLow(led_DISPLAY.Port,  led_DISPLAY.Pins))
//                   {
//                       FAIL("adi_GPIO_SetLow (led_DISPLAY)");
//                   }
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetHigh(led_DISPLAY1.Port, led_DISPLAY1.Pins))
//                   {
//                       FAIL("adi_GPIO_SetHigh (led_DISPLAY1)");
//                   }
//   				break;
//
//   			case 0:
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetHigh(led_DISPLAY.Port,  led_DISPLAY.Pins))
//                   {
//                       FAIL("adi_GPIO_SetHigh (led_DISPLAY)");
//                   }
//   				if (ADI_GPIO_SUCCESS != adi_GPIO_SetHigh (led_DISPLAY1.Port, led_DISPLAY1.Pins))
//                   {
//                       FAIL("adi_GPIO_SetHigh (led_DISPLAY1)");
//                   }
//   				break;
//
//   		}
//
//   		/* Apply module */
//   		count %= 4;
//   	}




    // Change HCLK clock divider to 1 for a 16MHz clock
    if (ADI_SYS_SUCCESS != SetSystemClockDivider(ADI_SYS_CLOCK_CORE, 1))
    {
            test_Fail("SetSystemClockDivider() failed");
    }

    // Change PCLK clock divider to 1 for a 16MHz clock
    if (ADI_SYS_SUCCESS != SetSystemClockDivider (ADI_SYS_CLOCK_UART, 1))
    {
            test_Fail("SetSystemClockDivider() failed");
    }

    /* test system initialization */
    test_Init();

