sfproductlabs/ADuCM350/src/main.c
    /* NVIC initialization */
    NVIC_SetPriorityGrouping(12);

#if (1 == USE_TIMERS)
    /* SysTick initialization */
    SysTick_Config(1000000);

    /* SysTick_Config() hardcodes priority. We override this. */
    NVIC_SetPriority(SysTick_IRQn, 14);

    /* Wakeup timer initialization */
    InitializeWUT();

    if( adi_WUT_SetTimerEnable(hWUT, true) != 0 ) {
        test_Fail("adi_WUT_SetTimerEnable failed");
    }
#endif /* (1 == USE_TIMERS) */

    testParityChecking(ADI_FEE_DEVID_0, 0x00000000u, 0x00000000u, 0x8000u, 0x0003E000u);
    testParityChecking(ADI_FEE_DEVID_1, 0x00040000u, 0x00040000u, 0x7C00u, 0x0005F000u);


    /* We *want* a repeatable sequence of psuedo-random numbers, so that
     * the flash address ranges tested are the same on each run. Since
     * the rand seed starts at zero by default this call only serves to
     * make this explicit and visible.
     */
    srand(0);

    /* Test flash controller 0 (upper half only, minus the parity area = 120k) */
    testFlash("Testing flash controller 0", ADI_FEE_DEVID_0, false, 0x00020000u, 120, 10);

    /* Test flash controller 1 (all) */
    testFlash("Testing flash controller 1", ADI_FEE_DEVID_1, true, 0x00040000u, 128, 10);

    /* Test GP flash controller (all) using PIO*/
    testFlash("Testing GP flash controller (PIO)", ADI_FEE_DEVID_GP, false, 0x20080000u, 16, 10);

#if (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT)
    /* Test GP flash controller (all) using DMA*/
    testFlash("Testing GP flash controller (DMA)", ADI_FEE_DEVID_GP, true, 0x20080000u, 16, 10);
#endif /* (1 == ADI_FEE_CFG_GPF_DMA_SUPPORT) */

    /* If we got here then nothing has failed */
    test_Pass();

    return 0;
//
//    /* Change the system clock source to HFXTAL and change clock frequency to 16MHz     */
//    /* Requirement for AFE (ACLK)                                                       */
//    if (ADI_SYS_SUCCESS != SystemTransitionClocks(ADI_SYS_CLOCK_TRIGGER_MEASUREMENT_ON))
//    {
//        FAIL("SystemTransitionClocks");
//    }
//
//    /* SPLL with 32MHz used, need to divide by 2 */
//    SetSystemClockDivider(ADI_SYS_CLOCK_UART, 2);
//
//    /* Test initialization */
//    test_Init();
//
//    /* Initialize static pinmuxing */
//    adi_initpinmux();
//
//    /* Initialize the UART for transferring measurement data out */
//    if (ADI_UART_SUCCESS != uart_Init())
//    {
//        FAIL("uart_Init");
//    }
//
//    /* Initialize the AFE API */
//    if (ADI_AFE_SUCCESS != adi_AFE_Init(&hDevice))
//    {
//        FAIL("Init");
//    }
//
//    /* Set RCAL and RTIA values */
//    if (ADI_AFE_SUCCESS != adi_AFE_SetRcal(hDevice, RCAL))
//    {
//        FAIL("adi_AFE_SetRcal");
//    }
//    if (ADI_AFE_SUCCESS != adi_AFE_SetRtia(hDevice, RTIA))
//    {
//        FAIL("adi_AFE_SetTia");
//    }
//
//
//    delay(2000000);
//
//
//    /* AFE power up */
//    if (ADI_AFE_SUCCESS != adi_AFE_PowerUp(hDevice))
//    {
//        FAIL("adi_AFE_PowerUp");
//    }
//
//    /* Delay to ensure Vbias is stable */
//    delay(2000000);
//
//    /* Temp Channel Calibration */
//    if (ADI_AFE_SUCCESS != adi_AFE_TempSensChanCal(hDevice))
//    {
//        PRINT("adi_AFE_TempSensChanCal");
//    }
//
//    /* Auxiliary Channel Calibration */
//    if (ADI_AFE_SUCCESS != adi_AFE_AuxChanCal(hDevice))
//    {
//        PRINT("adi_AFE_AuxChanCal");
//    }
//
//    /* Excitation Channel Power-Up */
//    if (ADI_AFE_SUCCESS != adi_AFE_ExciteChanPowerUp(hDevice))
//    {
//        FAIL("adi_AFE_ExciteChanPowerUp");
//    }
//
//    /* TempCal results will be used to set the TIA calibration registers. These */
//    /* values will ensure the ratio between current and voltage is exactly 1.5  */
//    if (ADI_AFE_SUCCESS != adi_AFE_ReadCalibrationRegister(hDevice, ADI_AFE_CAL_REG_ADC_GAIN_TEMP_SENS, &gain_code))
//    {
//        FAIL("adi_AFE_ReadCalibrationRegister, gain");
//    }
//    if (ADI_AFE_SUCCESS != adi_AFE_WriteCalibrationRegister(hDevice, ADI_AFE_CAL_REG_ADC_GAIN_TIA, gain_code))
//    {
//        FAIL("adi_AFE_WriteCalibrationRegister, gain");
//    }
//    if (ADI_AFE_SUCCESS != adi_AFE_ReadCalibrationRegister(hDevice, ADI_AFE_CAL_REG_ADC_OFFSET_TEMP_SENS, &offset_code))
//    {
//        FAIL("adi_AFE_ReadCalibrationRegister, offset");
//    }
//    if (ADI_AFE_SUCCESS != adi_AFE_WriteCalibrationRegister(hDevice, ADI_AFE_CAL_REG_ADC_OFFSET_TIA, offset_code))
//    {
//        FAIL("adi_AFE_WriteCalibrationRegister, offset");
//    }
//
//    /* Update FCW in the sequence */
//    seq_afe_poweritup[3] = SEQ_MMR_WRITE(REG_AFE_AFE_WG_FCW, FCW);
//    /* Update sine amplitude in the sequence */
//    seq_afe_poweritup[4] = SEQ_MMR_WRITE(REG_AFE_AFE_WG_AMPLITUDE, SINE_AMPLITUDE);
//
//    /* Recalculate CRC in software for the AC measurement, because we changed   */
//    /* FCW and sine amplitude settings.                                         */
//    adi_AFE_EnableSoftwareCRC(hDevice, true);
//
//    int run_max         = 100000000;        // do only hundred runs of each frequency sweep.
//    int run_iterator    = 0;
//    PRINT("STEP ONE\n");
//    if (ADI_AFE_SUCCESS != adi_AFE_RunSequence(hDevice, seq_afe_poweritup, (uint16_t *)dft_results, DFT_RESULTS_COUNT))
//    {
//     PRINT("AFE PROBLEM!");
//    }
//
//    //// How to create a timer? ////
//    // 16MHz clock,
//
//    /* initialize driver */
//    //rtc_Init();
//
//    //PRINT("RTC INITED\n");
//    /* calibrate */
//    //rtc_Calibrate();
//
//    //time_t rawtime;
//    // get the RTC count through the "time" CRTL function
//    //time(&rawtime);
//    //PRINT ("here\n");
//
////    clock_t start, end;
////    double cpu_time_used;
////    start = clock();
////    /* Do the work. */
////    end = clock();
////    cpu_time_used = ((double) (end - start)) / CLOCKS_PER_SEC;
////
//
//    /* get the time */
//    //rtc_ReportTime();
//
//    while (running) // running
//    {
//
//      fixed32_t           magnitude_result[DFT_RESULTS_COUNT / 2 - 1]={0};
//      char                msg[MSG_MAXLEN] = {0};
//      char                tmp[300] = {0};
//
//      // rtc_ReportTime();
//      /* Perform the Impedance measurement */
////      if (ADI_AFE_SUCCESS != adi_AFE_RunSequence(hDevice, seq_afe_fast_acmeasBioZ_4wire, (uint16_t *)dft_results, DFT_RESULTS_COUNT))
////      {
////        FAIL("Impedance Measurement");
////      }
//
//      if (ADI_AFE_SUCCESS != adi_AFE_RunSequence(hDevice, seq_afe_fast_meas_4wire, (uint16_t *)dft_results, DFT_RESULTS_COUNT))
//      {
//        FAIL("Impedance Measurement");
//      }
//
//      /* Convert DFT results to 1.15 and 1.31 formats.  */
//      convert_dft_results(dft_results, dft_results_q15, dft_results_q31);
//
//      /* Magnitude calculation */
//      /* Use CMSIS function */
//      arm_cmplx_mag_q31(dft_results_q31, magnitude, DFT_RESULTS_COUNT / 2);
//
//      /* Calculate final magnitude value, calibrated with RTIA the gain of the instrumenation amplifier */
//      rtiaAndGain = (uint32_t)((RTIA * 1.5) / INST_AMP_GAIN);
//      magnitude_result[0] = calculate_magnitude(magnitude[1], magnitude[0], rtiaAndGain);
//      //
//      sprintf_fixed32(tmp, magnitude_result[0]);
//      strcat(msg,tmp);
//      strcat(msg," \r\n");
//      PRINT(msg);
//
//      run_iterator++;
//      if (run_iterator >= run_max) {
//        running = 0;
//        break;
//      } // THIS ALLOWS THE CODE TO BREAK AFTER RUNNING FOR A WHILE.
//
//
//    }
//
//    /* Restore to using default CRC stored with the sequence */
//    // adi_AFE_EnableSoftwareCRC(hDevice, false);
//
//    /* AFE Power Down */
//    if (ADI_AFE_SUCCESS != adi_AFE_PowerDown(hDevice))
//    {
//        FAIL("PowerDown");
//    }
//
//    /* Uninitialize the AFE API */
//    if (ADI_AFE_SUCCESS != adi_AFE_UnInit(hDevice))
//    {
//        FAIL("Uninit");
//    }
//
//    /* Uninitilize the UART */
//    uart_UnInit();
//
//    PASS();

