sfproductlabs/ADuCM350/src/main.c
/* Calculates phase.                                        */
/* performs the calculation:                                */
/*      phase = (phase_2 - phase_1) * PI / (2 * PI) * 180   */
/*            = (phase_2 - phase_1) * 180                   */
/* Output in custom fixed-point format (28.4).              */
fixed32_t calculate_phase(q15_t phase_1, q15_t phase_2) {
    q63_t       phase;
    fixed32_t   out;

    /* Multiply by 180 to convert to degrees */
    phase = ((q63_t)(phase_2 - phase_1) * (q63_t)180);
    /* Round and convert to fixed32_t */
    out.full = ((phase + (q63_t)0x400) >> 11) & 0xFFFFFFFF;

    return out;
}


/* Simple conversion of a fixed32_t variable to string format. */
void sprintf_fixed32(char *out, fixed32_t in) {
    fixed32_t   tmp;

    if (in.full < 0) {
        tmp.parts.fpart = (16 - in.parts.fpart) & 0x0F;
        tmp.parts.ipart = in.parts.ipart;
        if (0 != in.parts.fpart) {
            tmp.parts.ipart++;
        }
        if (0 == tmp.parts.ipart) {
            sprintf(out, "      -0.%04d", tmp.parts.fpart * FIXED32_LSB_SIZE);
        }
        else {
            sprintf(out, "%8d.%04d", tmp.parts.ipart, tmp.parts.fpart * FIXED32_LSB_SIZE);
        }
    }
    else {
        sprintf(out, "%8d.%04d", in.parts.ipart, in.parts.fpart * FIXED32_LSB_SIZE);
    }

}

/* Helper function for printing fixed32_t (magnitude & phase) results */
void print_MagnitudePhase(char *text, fixed32_t magnitude, fixed32_t phase) {
    char                msg[MSG_MAXLEN];
    char                tmp[MSG_MAXLEN];

    sprintf(msg, "    %s = (", text);
    /* Magnitude */
    sprintf_fixed32(tmp, magnitude);
    strcat(msg, tmp);
    strcat(msg, ", ");
    /* Phase */
    sprintf_fixed32(tmp, phase);
    strcat(msg, tmp);
    strcat(msg, ")\r\n");

    PRINT(msg);
}

/* Helper function for printing a string to UART or Std. Output */
void test_print (char *pBuffer) {
#if (1 == USE_UART_FOR_DATA)
    int16_t size;
    /* Print to UART */
    size = strlen(pBuffer);
    adi_UART_BufTx(hUartDevice, pBuffer, &size);

#elif (0 == USE_UART_FOR_DATA)
    /* Print  to console */
    printf(pBuffer);

#endif /* USE_UART_FOR_DATA */
}

/* Initialize the UART, set the baud rate and enable */
ADI_UART_RESULT_TYPE uart_Init (void) {
    ADI_UART_RESULT_TYPE    result = ADI_UART_SUCCESS;

    /* Open UART in blocking, non-intrrpt mode by supplying no internal buffs */
    if (ADI_UART_SUCCESS != (result = adi_UART_Init(ADI_UART_DEVID_0, &hUartDevice, NULL)))
    {
        return result;
    }

    /* Set UART baud rate to 115200 */
    if (ADI_UART_SUCCESS != (result = adi_UART_SetBaudRate(hUartDevice, ADI_UART_BAUD_115200)))
    {
        return result;
    }

    /* Enable UART */
    if (ADI_UART_SUCCESS != (result = adi_UART_Enable(hUartDevice,true)))
    {
        return result;
    }

    return result;
}

/* Uninitialize the UART */
ADI_UART_RESULT_TYPE uart_UnInit (void) {
    ADI_UART_RESULT_TYPE    result = ADI_UART_SUCCESS;

    /* Uninitialize the UART API */
    if (ADI_UART_SUCCESS != (result = adi_UART_UnInit(hUartDevice)))
    {
        return result;
    }

    return result;
}

void rtc_Init (void) {

    PRINT("rtc init");

    /* callbacks */
    ADI_RTC_INT_SOURCE_TYPE callbacks = (ADI_RTC_INT_SOURCE_TYPE)
                                       ( ADI_RTC_INT_SOURCE_WRITE_PEND
                                       | ADI_RTC_INT_SOURCE_WRITE_SYNC
                                       | ADI_RTC_INT_SOURCE_WRITE_PENDERR
                                       | ADI_RTC_INT_SOURCE_ISO_DONE
                                       | ADI_RTC_INT_SOURCE_LCD_UPDATE
                                       | ADI_RTC_INT_SOURCE_ALARM
                                       | ADI_RTC_INT_SOURCE_FAIL);
    uint32_t buildTime = BuildSeconds();
    ADI_RTC_RESULT_TYPE result;

    result = adi_RTC_Init(ADI_RTC_DEVID_0, &hRTC);

    /* retry on failsafe */
    if (ADI_RTC_ERR_CLOCK_FAILSAFE == result) {

        /* clear the failsafe */
        adi_RTC_ClearFailSafe();

        /* un-init RTC for a clean restart, but ignore failure */
        adi_RTC_UnInit(hRTC);

        /* re-init RTC */
        if (ADI_RTC_SUCCESS != adi_RTC_Init(ADI_RTC_DEVID_0, &hRTC))
            PRINT("Double fault on adi_RTC_Init");

        PRINT("Resetting clock and trim values after init failure");

        /* set clock to latest build time */
        if (ADI_RTC_SUCCESS != adi_RTC_SetCount(hRTC, buildTime))
            PRINT("adi_RTC_SetCount failed");

        /* apply pre-computed calibration BOARD-SPECIFIC trim values */
        if (adi_RTC_SetTrim(hRTC, ADI_RTC_TRIM_INTERVAL | ADI_RTC_TRIM_DIRECTION | ADI_RTC_TRIM_VALUE))
            PRINT("adi_RTC_SetTrim failed");

        /* enable trimming */
        if (adi_RTC_EnableTrim(hRTC, true))
            PRINT("adi_RTC_EnableTrim failed");

    /* catch all other open failures */
    } else {
          //PRINT("could not initialize RTC \n");
		if (result != ADI_RTC_SUCCESS)
		  PRINT("Generic failure to initialize the RTC");
    }

    /* RTC opened successfully... */
      PRINT("RTC OPENED SUCCESSFULLY \n");

    /* disable alarm */
    if (ADI_RTC_SUCCESS != adi_RTC_EnableAlarm(hRTC, false))
        PRINT("adi_RTC_EnableAlarm failed");

//#ifdef ADI_RTC_RESET
    /* force a reset to the latest build timestamp */
//    PRINT("Resetting clock");
//    if (ADI_RTC_SUCCESS != adi_RTC_SetCount(hRTC, buildTime))
//        PRINT("adi_RTC_SetCount failed");
//    PRINT("New time is:");
//    rtc_ReportTime();
//#endif

    /* register callback handler for all interrupts */
    if (ADI_RTC_SUCCESS != adi_RTC_RegisterCallback (hRTC,  rtcCallback, callbacks)) {
        PRINT("adi_RTC_RegisterCallback failed");
    }

    /* enable RTC */
    if (ADI_RTC_SUCCESS != adi_RTC_EnableDevice(hRTC, true))
        PRINT("adi_RTC_EnableDevice failed");


