sfproductlabs/ADuCM350/src/main.c
	/* program GPIO to capture P0.10 pushbutton interrupt... */

	/* initialize GPIO driver */
//	if (adi_GPIO_Init()) {
//		FAIL("adi_GPIO_Init failed");
//	}
//
//	/* enable P0.10 input */
//    if (adi_GPIO_SetInputEnable(ADI_GPIO_PORT_0, ADI_GPIO_PIN_10, true)) {
//    	FAIL("Initialise_GPIO: adi_GPIO_SetInputEnable failed");
//    }
//
//	/* disable P0.10 output */
//    if (adi_GPIO_SetOutputEnable(ADI_GPIO_PORT_0, ADI_GPIO_PIN_10, false)) {
//    	FAIL("Initialise_GPIO: adi_GPIO_SetOutputEnable failed");
//    }
//
//	/* set P0.10 pullep enable */
//    if (adi_GPIO_SetPullUpEnable(ADI_GPIO_PORT_0, ADI_GPIO_PIN_10, true)) {
//    	FAIL("Initialise_GPIO: adi_GPIO_SetOutputEnable failed");
//    }
//
//    /* Register the external interrupt callback */
//    if(adi_GPIO_RegisterCallback(EINT8_IRQn,  Ext_Int8_Callback, NULL)) {
//      FAIL("Initialise_GPIO: adi_GPIO_RegisterCallbackExtInt failed");
//    }
//
//	/* enable P0.10 as external interrupt */
//    if (adi_GPIO_EnableIRQ(EINT8_IRQn,  ADI_GPIO_IRQ_EITHER_EDGE)) {
//    	FAIL("Initialise_GPIO: adi_GPIO_EnableIRQ failed");
//    }
//
//	/* release GPIO driver */
//	if (adi_GPIO_UnInit()) {
//		FAIL("adi_GPIO_Init failed");
//	}
}


//void rtc_Calibrate (void) {
//
//#ifdef ADI_RTC_CALIBRATE
//
//    /*
//
//    Compute the LF crystal trim values to compensate the RTC.  This can
//    come from a static measure (a frequency counter), a real-time drift measure
//    based on a USB transaction, Ethernet NTP or PTP protocol, or some other
//    external reference.
//
//    Commercial crystals typically run between 20-100 ppm.  As an exercise, we
//    demonstrate trimming a particular crystal and board configuration in which
//    we measure an untrimmed error of about +58.6ppm (0.00586%).  This corresponds
//    to a raw clock about 35.5 seconds/week fast (30 minutes/year).
//
//    Available Trim Corrections:
//    	X axis: trim interval (seconds)
//    	Y axis: trim value (seconds)
//    	Table content: trim correction (ppm)
//      Value     16384    32768    65536   131072 (Interval)
//        0        0.00     0.00     0.00     0.00
//        1       61.04    30.52    15.26     7.63
//        2      122.07    61.04    30.52    15.26
//        3      183.11    91.55    45.78    22.89
//        4      244.14   122.07    61.04    30.52
//        5      305.18   152.59    76.29    38.15
//        6      366.21   183.11    91.55    45.78
//        7      427.25   213.62   106.81    53.41
//
//    Referencing the trim table, we see the closest matching ppm correction for
//    our example is 61.04.  In case there are different combinations yielding
//    the same desired correction, we prefer the shortest trim interval (and
//    smallest trim value) so as to minimize instantaneous drift.
//
//    So we choose a trim interval of 2^14 seconds with a negative trim value of 1
//    second, subtracting 1 second every 4.5 hours to "slow" the fast crystal down
//    to a more reasonable rate.  This particular trim leaves a residual error of
//    negative 2.44ppm (0.000244%), making the trimmed clock a tad slow (less than
//    1.5 seconds/week or about 1.3 minutes/year), but much better than the
//    untrimmed accuracy of 30 minutes/year.
//
//    */
//
//    /* dial-up external LF crystal to clockout pin (P1.7) for measurement */
//    if (adi_GPIO_Init())
//        PRINT("adi_GPIO_Init failed");
//    SetSystemClockMux(ADI_SYS_CLOCK_MUX_LFCLK_LFXTAL);   // select LF crystal
//    SetSystemClockMux(ADI_SYS_CLOCK_MUX_OUTPUT_LF_CLK);  // route output
//
//    /* Use static pinmuxing */
//    adi_initpinmux();
//
//    //if (adi_GPIO_UnInit())
//    //    PRINT("adi_GPIO_UnInit failed");
//
//    //PRINT("RTC clockout programmed to P1.7 for calibration...");
//
//    /* program the BOARD-SPECIFIC computed trim value, as described above */
//    if (adi_RTC_SetTrim(hRTC, ADI_RTC_TRIM_INTERVAL | ADI_RTC_TRIM_DIRECTION | ADI_RTC_TRIM_VALUE))
//        PRINT("adi_RTC_SetTrim failed");
//
//    /* enable trim */
//    if (adi_RTC_EnableTrim(hRTC, true))
//        PRINT("adi_RTC_EnableTrim failed");
//
//#endif
//}

/* test standard ctime (time.h) constructs */
void rtc_ReportTime(void) {


  char buffer[300];
  char tmp[200];
  PRINT("REPORTING THE TIME\n");

  clock_t c = clock();

  PRINT("after clock call\n");
  double time_in_seconds = (double)c / (double)CLOCKS_PER_SECOND;
  PRINT("PRINTING IT OUT\n");
  sprintf(tmp,"%g seconds", time_in_seconds);
  strcat(buffer,tmp);
  strcat(buffer,"\r\n");
  PRINT(buffer);

}

/* External interrupt callback */
//static void Ext_Int8_Callback (void *pCBParam, uint32_t Event, void *pArg)
//{
//    /* clear the interrupt */
//    NVIC_ClearPendingIRQ(EINT8_IRQn);
//
//    /* also call hibernation exit API */
//    SystemExitLowPowerMode(&bHibernateExitFlag);
//}
//

uint32_t BuildSeconds(void)
{
    /* count up seconds from the epoc (1/1/70) to the most recient build time */

    char timestamp[] = __DATE__ " " __TIME__;
    int month_days [] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    uint32_t days, month, date, year, hours, minutes, seconds;
    char Month[4];

    // parse the build timestamp
    sscanf(timestamp, "%s %d %d %d:%d:%d", Month, &date, &year, &hours, &minutes, &seconds);

    // parse ASCII month to a value
    if     ( !strncmp(Month, "Jan", 3 )) month = 1;
    else if( !strncmp(Month, "Feb", 3 )) month = 2;
    else if( !strncmp(Month, "Mar", 3 )) month = 3;
    else if( !strncmp(Month, "Apr", 3 )) month = 4;
    else if( !strncmp(Month, "May", 3 )) month = 5;
    else if( !strncmp(Month, "Jun", 3 )) month = 6;
    else if( !strncmp(Month, "Jul", 3 )) month = 7;
    else if( !strncmp(Month, "Aug", 3 )) month = 8;
    else if( !strncmp(Month, "Sep", 3 )) month = 9;
    else if( !strncmp(Month, "Oct", 3 )) month = 10;
    else if( !strncmp(Month, "Nov", 3 )) month = 11;
    else if( !strncmp(Month, "Dec", 3 )) month = 12;

